[errorMsg]

PCT_ERR_FAIL="unbekannter Fehler"

PCT_ERR_INVALUD_PARS="Ungültiger Parameter"

PCT_ERR_NOT_SURPPORT="Nicht unterstützt"

PCT_ERR_OPEN_FILE_FAIL="Kann Datei nicht öffnen"

PCT_ERR_NO_MEMORY="Zuwenig Speicher"

PCT_ERR_READ_FILE="Kann Datei nicht lesen"

PCT_ERR_FILE_FORMAT="Fehler, Dateiformat"

PCT_ERR_NOMORE_ITEM="Keine Dateien mehr übrig"

PCT_ERR_FILE_PROCESS="Kann Datei nicht verarbeiten"

PCT_ERR_MEMORY_FAIL="Speicherfehler"

PCT_ERR_WRITE_FILE="Kann Datei nicht schreiben"

PCT_ERR_USER_CANCEL="Abbruch durch Benutzer"

PCT_ERR_NOT_INIT_FUN="Nicht initialisiert"

PCT_ERR_CREATE_THREAD="Kann Thread nicht erstellen"

PCT_ERR_DEVICE_NO_MORE_SPACE="Zuwenig Festplattenspeicher"

PCT_ERR_DEVICE_FAIL="Device Fehler"

PCT_ERR_PATH_INVALID="ungültiger Pfad"

PCT_ERR_CALL_API="Aufruf fehlgeschlagen"

PCT_ERR_FILE_NOT_EXIST="Datei existiert nicht"

PCT_ERR_FILE_IN_USING="Die Datei wird von einem anderen Prozess verwendet."

PCT_ERR_REG_FAIL="Registry Fehler"

PCT_ERR_NET_CONN="Netzwerk nicht angeschlossen oder unterbrochen"

PCT_ERR_LICENSE_OUTDATA="Lizenz abgelaufen"

PCT_ERR_NOT_SAME_VERSION="Versionen inkompatibel"

PCT_ERR_NO_DISKSPACE="Zuwenig Festplattenspeicher"

PCT_ERR_NTFS_MUST="Die ausgewählten Applikationen können nicht übertragen werden, da sie unter NTFS installiert sind."

PCT_ERR_INSTALL_APPX_FAILED="Diese Anwendungen sind mit dem Ziel-PC nicht kompatibel. Eine Neuinstallation ist erforderlich."

PCT_ERR_MOVE_APPX_FAILED="Die Anwendung ist nicht kompatibel mit dem Dateisystem der Zielpartition."

